###################################################################

# Created by write_sdc on Fri Feb 13 10:12:28 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_capacitance 0.2 [current_design]
set_max_transition 1.5 [current_design]
set_load -pin_load 0.02 [get_ports {p[31]}]
set_load -pin_load 0.02 [get_ports {p[30]}]
set_load -pin_load 0.02 [get_ports {p[29]}]
set_load -pin_load 0.02 [get_ports {p[28]}]
set_load -pin_load 0.02 [get_ports {p[27]}]
set_load -pin_load 0.02 [get_ports {p[26]}]
set_load -pin_load 0.02 [get_ports {p[25]}]
set_load -pin_load 0.02 [get_ports {p[24]}]
set_load -pin_load 0.02 [get_ports {p[23]}]
set_load -pin_load 0.02 [get_ports {p[22]}]
set_load -pin_load 0.02 [get_ports {p[21]}]
set_load -pin_load 0.02 [get_ports {p[20]}]
set_load -pin_load 0.02 [get_ports {p[19]}]
set_load -pin_load 0.02 [get_ports {p[18]}]
set_load -pin_load 0.02 [get_ports {p[17]}]
set_load -pin_load 0.02 [get_ports {p[16]}]
set_load -pin_load 0.02 [get_ports {p[15]}]
set_load -pin_load 0.02 [get_ports {p[14]}]
set_load -pin_load 0.02 [get_ports {p[13]}]
set_load -pin_load 0.02 [get_ports {p[12]}]
set_load -pin_load 0.02 [get_ports {p[11]}]
set_load -pin_load 0.02 [get_ports {p[10]}]
set_load -pin_load 0.02 [get_ports {p[9]}]
set_load -pin_load 0.02 [get_ports {p[8]}]
set_load -pin_load 0.02 [get_ports {p[7]}]
set_load -pin_load 0.02 [get_ports {p[6]}]
set_load -pin_load 0.02 [get_ports {p[5]}]
set_load -pin_load 0.02 [get_ports {p[4]}]
set_load -pin_load 0.02 [get_ports {p[3]}]
set_load -pin_load 0.02 [get_ports {p[2]}]
set_load -pin_load 0.02 [get_ports {p[1]}]
set_load -pin_load 0.02 [get_ports {p[0]}]
set_max_fanout 1 [get_ports clk]
set_max_fanout 1 [get_ports rst_n]
set_max_fanout 1 [get_ports {a[15]}]
set_max_fanout 1 [get_ports {a[14]}]
set_max_fanout 1 [get_ports {a[13]}]
set_max_fanout 1 [get_ports {a[12]}]
set_max_fanout 1 [get_ports {a[11]}]
set_max_fanout 1 [get_ports {a[10]}]
set_max_fanout 1 [get_ports {a[9]}]
set_max_fanout 1 [get_ports {a[8]}]
set_max_fanout 1 [get_ports {a[7]}]
set_max_fanout 1 [get_ports {a[6]}]
set_max_fanout 1 [get_ports {a[5]}]
set_max_fanout 1 [get_ports {a[4]}]
set_max_fanout 1 [get_ports {a[3]}]
set_max_fanout 1 [get_ports {a[2]}]
set_max_fanout 1 [get_ports {a[1]}]
set_max_fanout 1 [get_ports {a[0]}]
set_max_fanout 1 [get_ports {b[15]}]
set_max_fanout 1 [get_ports {b[14]}]
set_max_fanout 1 [get_ports {b[13]}]
set_max_fanout 1 [get_ports {b[12]}]
set_max_fanout 1 [get_ports {b[11]}]
set_max_fanout 1 [get_ports {b[10]}]
set_max_fanout 1 [get_ports {b[9]}]
set_max_fanout 1 [get_ports {b[8]}]
set_max_fanout 1 [get_ports {b[7]}]
set_max_fanout 1 [get_ports {b[6]}]
set_max_fanout 1 [get_ports {b[5]}]
set_max_fanout 1 [get_ports {b[4]}]
set_max_fanout 1 [get_ports {b[3]}]
set_max_fanout 1 [get_ports {b[2]}]
set_max_fanout 1 [get_ports {b[1]}]
set_max_fanout 1 [get_ports {b[0]}]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty -setup 1.2  [get_clocks clk]
set_clock_uncertainty -hold 1  [get_clocks clk]
set_clock_transition -max -rise 0.1 [get_clocks clk]
set_clock_transition -min -rise 0.1 [get_clocks clk]
set_clock_transition -max -fall 0.12 [get_clocks clk]
set_clock_transition -min -fall 0.12 [get_clocks clk]
create_clock -name v_clk  -period 10  -waveform {0 5}
set_input_delay -clock v_clk  3  [get_ports rst_n]
set_input_delay -clock v_clk  3  [get_ports {a[15]}]
set_input_delay -clock v_clk  3  [get_ports {a[14]}]
set_input_delay -clock v_clk  3  [get_ports {a[13]}]
set_input_delay -clock v_clk  3  [get_ports {a[12]}]
set_input_delay -clock v_clk  3  [get_ports {a[11]}]
set_input_delay -clock v_clk  3  [get_ports {a[10]}]
set_input_delay -clock v_clk  3  [get_ports {a[9]}]
set_input_delay -clock v_clk  3  [get_ports {a[8]}]
set_input_delay -clock v_clk  3  [get_ports {a[7]}]
set_input_delay -clock v_clk  3  [get_ports {a[6]}]
set_input_delay -clock v_clk  3  [get_ports {a[5]}]
set_input_delay -clock v_clk  3  [get_ports {a[4]}]
set_input_delay -clock v_clk  3  [get_ports {a[3]}]
set_input_delay -clock v_clk  3  [get_ports {a[2]}]
set_input_delay -clock v_clk  3  [get_ports {a[1]}]
set_input_delay -clock v_clk  3  [get_ports {a[0]}]
set_input_delay -clock v_clk  3  [get_ports {b[15]}]
set_input_delay -clock v_clk  3  [get_ports {b[14]}]
set_input_delay -clock v_clk  3  [get_ports {b[13]}]
set_input_delay -clock v_clk  3  [get_ports {b[12]}]
set_input_delay -clock v_clk  3  [get_ports {b[11]}]
set_input_delay -clock v_clk  3  [get_ports {b[10]}]
set_input_delay -clock v_clk  3  [get_ports {b[9]}]
set_input_delay -clock v_clk  3  [get_ports {b[8]}]
set_input_delay -clock v_clk  3  [get_ports {b[7]}]
set_input_delay -clock v_clk  3  [get_ports {b[6]}]
set_input_delay -clock v_clk  3  [get_ports {b[5]}]
set_input_delay -clock v_clk  3  [get_ports {b[4]}]
set_input_delay -clock v_clk  3  [get_ports {b[3]}]
set_input_delay -clock v_clk  3  [get_ports {b[2]}]
set_input_delay -clock v_clk  3  [get_ports {b[1]}]
set_input_delay -clock v_clk  3  [get_ports {b[0]}]
set_output_delay -clock v_clk  3  [get_ports {p[31]}]
set_output_delay -clock v_clk  3  [get_ports {p[30]}]
set_output_delay -clock v_clk  3  [get_ports {p[29]}]
set_output_delay -clock v_clk  3  [get_ports {p[28]}]
set_output_delay -clock v_clk  3  [get_ports {p[27]}]
set_output_delay -clock v_clk  3  [get_ports {p[26]}]
set_output_delay -clock v_clk  3  [get_ports {p[25]}]
set_output_delay -clock v_clk  3  [get_ports {p[24]}]
set_output_delay -clock v_clk  3  [get_ports {p[23]}]
set_output_delay -clock v_clk  3  [get_ports {p[22]}]
set_output_delay -clock v_clk  3  [get_ports {p[21]}]
set_output_delay -clock v_clk  3  [get_ports {p[20]}]
set_output_delay -clock v_clk  3  [get_ports {p[19]}]
set_output_delay -clock v_clk  3  [get_ports {p[18]}]
set_output_delay -clock v_clk  3  [get_ports {p[17]}]
set_output_delay -clock v_clk  3  [get_ports {p[16]}]
set_output_delay -clock v_clk  3  [get_ports {p[15]}]
set_output_delay -clock v_clk  3  [get_ports {p[14]}]
set_output_delay -clock v_clk  3  [get_ports {p[13]}]
set_output_delay -clock v_clk  3  [get_ports {p[12]}]
set_output_delay -clock v_clk  3  [get_ports {p[11]}]
set_output_delay -clock v_clk  3  [get_ports {p[10]}]
set_output_delay -clock v_clk  3  [get_ports {p[9]}]
set_output_delay -clock v_clk  3  [get_ports {p[8]}]
set_output_delay -clock v_clk  3  [get_ports {p[7]}]
set_output_delay -clock v_clk  3  [get_ports {p[6]}]
set_output_delay -clock v_clk  3  [get_ports {p[5]}]
set_output_delay -clock v_clk  3  [get_ports {p[4]}]
set_output_delay -clock v_clk  3  [get_ports {p[3]}]
set_output_delay -clock v_clk  3  [get_ports {p[2]}]
set_output_delay -clock v_clk  3  [get_ports {p[1]}]
set_output_delay -clock v_clk  3  [get_ports {p[0]}]
set_input_transition -max -rise 0.1  [get_ports clk]
set_input_transition -max -fall 0.12  [get_ports clk]
set_input_transition -min -rise 0.1  [get_ports clk]
set_input_transition -min -fall 0.12  [get_ports clk]
set_input_transition -max -rise 0.1  [get_ports rst_n]
set_input_transition -max -fall 0.12  [get_ports rst_n]
set_input_transition -min -rise 0.1  [get_ports rst_n]
set_input_transition -min -fall 0.12  [get_ports rst_n]
set_input_transition -max -rise 0.1  [get_ports {a[15]}]
set_input_transition -max -fall 0.12  [get_ports {a[15]}]
set_input_transition -min -rise 0.1  [get_ports {a[15]}]
set_input_transition -min -fall 0.12  [get_ports {a[15]}]
set_input_transition -max -rise 0.1  [get_ports {a[14]}]
set_input_transition -max -fall 0.12  [get_ports {a[14]}]
set_input_transition -min -rise 0.1  [get_ports {a[14]}]
set_input_transition -min -fall 0.12  [get_ports {a[14]}]
set_input_transition -max -rise 0.1  [get_ports {a[13]}]
set_input_transition -max -fall 0.12  [get_ports {a[13]}]
set_input_transition -min -rise 0.1  [get_ports {a[13]}]
set_input_transition -min -fall 0.12  [get_ports {a[13]}]
set_input_transition -max -rise 0.1  [get_ports {a[12]}]
set_input_transition -max -fall 0.12  [get_ports {a[12]}]
set_input_transition -min -rise 0.1  [get_ports {a[12]}]
set_input_transition -min -fall 0.12  [get_ports {a[12]}]
set_input_transition -max -rise 0.1  [get_ports {a[11]}]
set_input_transition -max -fall 0.12  [get_ports {a[11]}]
set_input_transition -min -rise 0.1  [get_ports {a[11]}]
set_input_transition -min -fall 0.12  [get_ports {a[11]}]
set_input_transition -max -rise 0.1  [get_ports {a[10]}]
set_input_transition -max -fall 0.12  [get_ports {a[10]}]
set_input_transition -min -rise 0.1  [get_ports {a[10]}]
set_input_transition -min -fall 0.12  [get_ports {a[10]}]
set_input_transition -max -rise 0.1  [get_ports {a[9]}]
set_input_transition -max -fall 0.12  [get_ports {a[9]}]
set_input_transition -min -rise 0.1  [get_ports {a[9]}]
set_input_transition -min -fall 0.12  [get_ports {a[9]}]
set_input_transition -max -rise 0.1  [get_ports {a[8]}]
set_input_transition -max -fall 0.12  [get_ports {a[8]}]
set_input_transition -min -rise 0.1  [get_ports {a[8]}]
set_input_transition -min -fall 0.12  [get_ports {a[8]}]
set_input_transition -max -rise 0.1  [get_ports {a[7]}]
set_input_transition -max -fall 0.12  [get_ports {a[7]}]
set_input_transition -min -rise 0.1  [get_ports {a[7]}]
set_input_transition -min -fall 0.12  [get_ports {a[7]}]
set_input_transition -max -rise 0.1  [get_ports {a[6]}]
set_input_transition -max -fall 0.12  [get_ports {a[6]}]
set_input_transition -min -rise 0.1  [get_ports {a[6]}]
set_input_transition -min -fall 0.12  [get_ports {a[6]}]
set_input_transition -max -rise 0.1  [get_ports {a[5]}]
set_input_transition -max -fall 0.12  [get_ports {a[5]}]
set_input_transition -min -rise 0.1  [get_ports {a[5]}]
set_input_transition -min -fall 0.12  [get_ports {a[5]}]
set_input_transition -max -rise 0.1  [get_ports {a[4]}]
set_input_transition -max -fall 0.12  [get_ports {a[4]}]
set_input_transition -min -rise 0.1  [get_ports {a[4]}]
set_input_transition -min -fall 0.12  [get_ports {a[4]}]
set_input_transition -max -rise 0.1  [get_ports {a[3]}]
set_input_transition -max -fall 0.12  [get_ports {a[3]}]
set_input_transition -min -rise 0.1  [get_ports {a[3]}]
set_input_transition -min -fall 0.12  [get_ports {a[3]}]
set_input_transition -max -rise 0.1  [get_ports {a[2]}]
set_input_transition -max -fall 0.12  [get_ports {a[2]}]
set_input_transition -min -rise 0.1  [get_ports {a[2]}]
set_input_transition -min -fall 0.12  [get_ports {a[2]}]
set_input_transition -max -rise 0.1  [get_ports {a[1]}]
set_input_transition -max -fall 0.12  [get_ports {a[1]}]
set_input_transition -min -rise 0.1  [get_ports {a[1]}]
set_input_transition -min -fall 0.12  [get_ports {a[1]}]
set_input_transition -max -rise 0.1  [get_ports {a[0]}]
set_input_transition -max -fall 0.12  [get_ports {a[0]}]
set_input_transition -min -rise 0.1  [get_ports {a[0]}]
set_input_transition -min -fall 0.12  [get_ports {a[0]}]
set_input_transition -max -rise 0.1  [get_ports {b[15]}]
set_input_transition -max -fall 0.12  [get_ports {b[15]}]
set_input_transition -min -rise 0.1  [get_ports {b[15]}]
set_input_transition -min -fall 0.12  [get_ports {b[15]}]
set_input_transition -max -rise 0.1  [get_ports {b[14]}]
set_input_transition -max -fall 0.12  [get_ports {b[14]}]
set_input_transition -min -rise 0.1  [get_ports {b[14]}]
set_input_transition -min -fall 0.12  [get_ports {b[14]}]
set_input_transition -max -rise 0.1  [get_ports {b[13]}]
set_input_transition -max -fall 0.12  [get_ports {b[13]}]
set_input_transition -min -rise 0.1  [get_ports {b[13]}]
set_input_transition -min -fall 0.12  [get_ports {b[13]}]
set_input_transition -max -rise 0.1  [get_ports {b[12]}]
set_input_transition -max -fall 0.12  [get_ports {b[12]}]
set_input_transition -min -rise 0.1  [get_ports {b[12]}]
set_input_transition -min -fall 0.12  [get_ports {b[12]}]
set_input_transition -max -rise 0.1  [get_ports {b[11]}]
set_input_transition -max -fall 0.12  [get_ports {b[11]}]
set_input_transition -min -rise 0.1  [get_ports {b[11]}]
set_input_transition -min -fall 0.12  [get_ports {b[11]}]
set_input_transition -max -rise 0.1  [get_ports {b[10]}]
set_input_transition -max -fall 0.12  [get_ports {b[10]}]
set_input_transition -min -rise 0.1  [get_ports {b[10]}]
set_input_transition -min -fall 0.12  [get_ports {b[10]}]
set_input_transition -max -rise 0.1  [get_ports {b[9]}]
set_input_transition -max -fall 0.12  [get_ports {b[9]}]
set_input_transition -min -rise 0.1  [get_ports {b[9]}]
set_input_transition -min -fall 0.12  [get_ports {b[9]}]
set_input_transition -max -rise 0.1  [get_ports {b[8]}]
set_input_transition -max -fall 0.12  [get_ports {b[8]}]
set_input_transition -min -rise 0.1  [get_ports {b[8]}]
set_input_transition -min -fall 0.12  [get_ports {b[8]}]
set_input_transition -max -rise 0.1  [get_ports {b[7]}]
set_input_transition -max -fall 0.12  [get_ports {b[7]}]
set_input_transition -min -rise 0.1  [get_ports {b[7]}]
set_input_transition -min -fall 0.12  [get_ports {b[7]}]
set_input_transition -max -rise 0.1  [get_ports {b[6]}]
set_input_transition -max -fall 0.12  [get_ports {b[6]}]
set_input_transition -min -rise 0.1  [get_ports {b[6]}]
set_input_transition -min -fall 0.12  [get_ports {b[6]}]
set_input_transition -max -rise 0.1  [get_ports {b[5]}]
set_input_transition -max -fall 0.12  [get_ports {b[5]}]
set_input_transition -min -rise 0.1  [get_ports {b[5]}]
set_input_transition -min -fall 0.12  [get_ports {b[5]}]
set_input_transition -max -rise 0.1  [get_ports {b[4]}]
set_input_transition -max -fall 0.12  [get_ports {b[4]}]
set_input_transition -min -rise 0.1  [get_ports {b[4]}]
set_input_transition -min -fall 0.12  [get_ports {b[4]}]
set_input_transition -max -rise 0.1  [get_ports {b[3]}]
set_input_transition -max -fall 0.12  [get_ports {b[3]}]
set_input_transition -min -rise 0.1  [get_ports {b[3]}]
set_input_transition -min -fall 0.12  [get_ports {b[3]}]
set_input_transition -max -rise 0.1  [get_ports {b[2]}]
set_input_transition -max -fall 0.12  [get_ports {b[2]}]
set_input_transition -min -rise 0.1  [get_ports {b[2]}]
set_input_transition -min -fall 0.12  [get_ports {b[2]}]
set_input_transition -max -rise 0.1  [get_ports {b[1]}]
set_input_transition -max -fall 0.12  [get_ports {b[1]}]
set_input_transition -min -rise 0.1  [get_ports {b[1]}]
set_input_transition -min -fall 0.12  [get_ports {b[1]}]
set_input_transition -max -rise 0.1  [get_ports {b[0]}]
set_input_transition -max -fall 0.12  [get_ports {b[0]}]
set_input_transition -min -rise 0.1  [get_ports {b[0]}]
set_input_transition -min -fall 0.12  [get_ports {b[0]}]
